Revit 2024 API
SpecUtils Methods
The SpecUtils type exposes the following members.
Methods
Name | Description
GetAllSpecs
 Gets the identifiers of all specs.
IsSpec
 Checks whether a ForgeTypeId identifies a spec.
IsValidDataType
 Returns true if the given ForgeTypeId identifies a valid parameter data type.
See Also
SpecUtils Class
Autodesk.Revit.DB Namespace